## Terraform Plan Results

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # fastly_domain_v1.apex will be created
  + resource "fastly_domain_v1" "apex" {
      + domain_id  = (known after apply)
      + fqdn       = "mealfinding.com"
      + id         = (known after apply)
      + service_id = (known after apply)
    }

  # fastly_domain_v1.api will be created
  + resource "fastly_domain_v1" "api" {
      + domain_id  = (known after apply)
      + fqdn       = "api.mealfinding.com"
      + id         = (known after apply)
      + service_id = (known after apply)
    }

  # fastly_domain_v1.www will be created
  + resource "fastly_domain_v1" "www" {
      + domain_id  = (known after apply)
      + fqdn       = "www.mealfinding.com"
      + id         = (known after apply)
      + service_id = (known after apply)
    }

  # fastly_service_vcl.mealfinding is tainted, so must be replaced
-/+ resource "fastly_service_vcl" "mealfinding" {
      + active_version     = (known after apply)
      ~ cloned_version     = 1 -> (known after apply)
      ~ force_refresh      = false -> (known after apply)
      ~ id                 = "BYZWcId6xNO57bwsUtJ8uL" -> (known after apply)
      ~ imported           = false -> (known after apply)
        name               = "mealfinding-production"
      + staged_version     = (known after apply)
        # (8 unchanged attributes hidden)

      - backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      - cache_setting {
          - action          = "pass" -> null
          - cache_condition = "is_api_request" -> null
          - name            = "pass_api_requests" -> null
          - stale_ttl       = 0 -> null
          - ttl             = 0 -> null
        }
      + cache_setting {
          + action          = "pass"
          + cache_condition = "is_api_request"
          + name            = "pass_api_requests"
        }

      - header {
          - action        = "delete" -> null
          - destination   = "http.Server" -> null
          - ignore_if_set = false -> null
          - name          = "remove_server" -> null
          - priority      = 50 -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "delete" -> null
          - destination   = "http.X-Powered-By" -> null
          - ignore_if_set = false -> null
          - name          = "remove_x_powered_by" -> null
          - priority      = 50 -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.Content-Security-Policy" -> null
          - ignore_if_set = false -> null
          - name          = "add_csp" -> null
          - priority      = 100 -> null
          - source        = "\"default-src 'self'; script-src 'self' 'unsafe-inline' 'unsafe-eval'; style-src 'self' 'unsafe-inline'; img-src 'self' data: https:; font-src 'self' data:; connect-src 'self' https://api.mealfinding.com\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.Referrer-Policy" -> null
          - ignore_if_set = false -> null
          - name          = "add_referrer_policy" -> null
          - priority      = 100 -> null
          - source        = "\"strict-origin-when-cross-origin\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.Strict-Transport-Security" -> null
          - ignore_if_set = false -> null
          - name          = "add_hsts" -> null
          - priority      = 100 -> null
          - source        = "\"max-age=31536000; includeSubDomains; preload\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.X-Content-Type-Options" -> null
          - ignore_if_set = false -> null
          - name          = "add_xcto" -> null
          - priority      = 100 -> null
          - source        = "\"nosniff\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.X-Frame-Options" -> null
          - ignore_if_set = false -> null
          - name          = "add_xfo" -> null
          - priority      = 100 -> null
          - source        = "\"SAMEORIGIN\"" -> null
          - type          = "response" -> null
        }
      + header {
          + action        = "delete"
          + destination   = "http.Server"
          + ignore_if_set = false
          + name          = "remove_server"
          + priority      = 50
          + regex         = (known after apply)
          + source        = (known after apply)
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "delete"
          + destination   = "http.X-Powered-By"
          + ignore_if_set = false
          + name          = "remove_x_powered_by"
          + priority      = 50
          + regex         = (known after apply)
          + source        = (known after apply)
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Content-Security-Policy"
          + ignore_if_set = false
          + name          = "add_csp"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"default-src 'self'; script-src 'self' 'unsafe-inline' 'unsafe-eval'; style-src 'self' 'unsafe-inline'; img-src 'self' data: https:; font-src 'self' data:; connect-src 'self' https://api.mealfinding.com\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Referrer-Policy"
          + ignore_if_set = false
          + name          = "add_referrer_policy"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"strict-origin-when-cross-origin\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Strict-Transport-Security"
          + ignore_if_set = false
          + name          = "add_hsts"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"max-age=31536000; includeSubDomains; preload\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.X-Content-Type-Options"
          + ignore_if_set = false
          + name          = "add_xcto"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"nosniff\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.X-Frame-Options"
          + ignore_if_set = false
          + name          = "add_xfo"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"SAMEORIGIN\""
          + substitution  = (known after apply)
          + type          = "response"
        }

      - request_setting {
          - bypass_busy_wait = false -> null
          - force_miss       = false -> null
          - force_ssl        = true -> null
          - max_stale_age    = 0 -> null
          - name             = "force_ssl" -> null
          - timer_support    = false -> null
        }
      + request_setting {
          + bypass_busy_wait = false
          + force_miss       = false
          + force_ssl        = true
          + name             = "force_ssl"
          + timer_support    = false
        }

      - vcl {
          - content = <<-EOT
                # Custom VCL for Mealfinding CDN
                # Handles subdomain-based routing, cache key customization, and error handling
                
                # ============================================
                # BACKEND DECLARATIONS (auto-generated by Terraform)
                # Reference names: F_web_origin, F_api_origin
                # ============================================
                
                sub vcl_recv {
                  #FASTLY recv
                
                  # ----------------------------------------
                  # Backend Selection Based on Subdomain
                  # ----------------------------------------
                
                  # Route API subdomain to API backend
                  if (req.http.host == "api.mealfinding.com") {
                    set req.backend = F_api_origin;
                  }
                  # Route www and apex domain to web backend
                  else if (req.http.host ~ "^(www\.)?mealfinding\.com$") {
                    set req.backend = F_web_origin;
                  }
                  # Default fallback to web backend
                  else {
                    set req.backend = F_web_origin;
                  }
                
                  # ----------------------------------------
                  # Force HTTPS
                  # ----------------------------------------
                  if (!req.http.Fastly-SSL) {
                    error 801 "Force HTTPS";
                  }
                
                  # ----------------------------------------
                  # Redirect apex to www (optional - commented out by default)
                  # ----------------------------------------
                  # if (req.http.host == "mealfinding.com") {
                  #   error 802 "Redirect to www";
                  # }
                
                  # ----------------------------------------
                  # Normalize Accept-Encoding for better cache hit ratio
                  # ----------------------------------------
                  if (req.http.Accept-Encoding) {
                    if (req.http.Accept-Encoding ~ "br") {
                      set req.http.Accept-Encoding = "br";
                    } elsif (req.http.Accept-Encoding ~ "gzip") {
                      set req.http.Accept-Encoding = "gzip";
                    } else {
                      unset req.http.Accept-Encoding;
                    }
                  }
                
                  # ----------------------------------------
                  # Strip query params from static assets for better cache hit ratio
                  # ----------------------------------------
                  if (req.url.ext ~ "^(js|css|png|jpg|jpeg|gif|ico|svg|woff|woff2|ttf|eot|webp|avif)$") {
                    set req.url = req.url.path;
                  }
                
                  # ----------------------------------------
                  # API: Don't cache requests with Authorization header
                  # ----------------------------------------
                  if (req.http.host == "api.mealfinding.com" && req.http.Authorization) {
                    return(pass);
                  }
                }
                
                sub vcl_hash {
                  #FASTLY hash
                
                  # Include host in cache key to separate www vs api content
                  hash_data(req.http.host);
                }
                
                sub vcl_fetch {
                  #FASTLY fetch
                
                  # ----------------------------------------
                  # Static Assets: Set long TTL
                  # ----------------------------------------
                  if (req.url.ext ~ "^(js|css|png|jpg|jpeg|gif|ico|svg|woff|woff2|ttf|eot|webp|avif)$") {
                    # Cache static assets for 1 day at edge, allow stale for 7 days
                    set beresp.ttl = 86400s;
                    set beresp.stale_while_revalidate = 604800s;
                    set beresp.stale_if_error = 604800s;
                  }
                
                  # ----------------------------------------
                  # HTML: Set moderate TTL for SSG content
                  # ----------------------------------------
                  if (beresp.http.Content-Type ~ "text/html") {
                    set beresp.ttl = 3600s;
                    set beresp.stale_while_revalidate = 3600s;
                    set beresp.stale_if_error = 86400s;
                  }
                
                  # ----------------------------------------
                  # API: Respect Cache-Control headers, or don't cache
                  # ----------------------------------------
                  if (req.http.host == "api.mealfinding.com") {
                    # If origin doesn't set cache headers, don't cache
                    if (!beresp.http.Cache-Control) {
                      set beresp.ttl = 0s;
                      return(pass);
                    }
                  }
                
                  # ----------------------------------------
                  # Don't cache error responses
                  # ----------------------------------------
                  if (beresp.status >= 500 && beresp.status < 600) {
                    set beresp.ttl = 0s;
                    return(pass);
                  }
                }
                
                sub vcl_deliver {
                  #FASTLY deliver
                
                  # ----------------------------------------
                  # Add cache status header for debugging
                  # ----------------------------------------
                  if (resp.http.X-Cache) {
                    set resp.http.X-Cache = resp.http.X-Cache ", " if(fastly_info.state ~ "^HIT", "HIT", "MISS");
                  } else {
                    set resp.http.X-Cache = if(fastly_info.state ~ "^HIT", "HIT", "MISS");
                  }
                
                  # Add cache hits info
                  set resp.http.X-Cache-Hits = obj.hits;
                }
                
                sub vcl_error {
                  #FASTLY error
                
                  # ----------------------------------------
                  # Custom Error: Force HTTPS redirect
                  # ----------------------------------------
                  if (obj.status == 801) {
                    set obj.status = 301;
                    set obj.http.Location = "https://" + req.http.host + req.url;
                    set obj.response = "Moved Permanently";
                    synthetic {""};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom Error: Redirect apex to www
                  # ----------------------------------------
                  if (obj.status == 802) {
                    set obj.status = 301;
                    set obj.http.Location = "https://www.mealfinding.com" + req.url;
                    set obj.response = "Moved Permanently";
                    synthetic {""};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom 503 Error Page
                  # ----------------------------------------
                  if (obj.status == 503) {
                    set obj.http.Content-Type = "text/html; charset=utf-8";
                    synthetic {"
                <!DOCTYPE html>
                <html lang="en">
                <head>
                  <meta charset="UTF-8">
                  <meta name="viewport" content="width=device-width, initial-scale=1.0">
                  <title>Temporarily Unavailable - Mealfinding</title>
                  <style>
                    body { font-family: system-ui, sans-serif; max-width: 600px; margin: 100px auto; padding: 20px; text-align: center; }
                    h1 { color: #333; }
                    p { color: #666; }
                  </style>
                </head>
                <body>
                  <h1>We'll be right back</h1>
                  <p>Mealfinding is temporarily unavailable. Please try again in a few moments.</p>
                </body>
                </html>
                "};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom 404 Error Page
                  # ----------------------------------------
                  if (obj.status == 404) {
                    set obj.http.Content-Type = "text/html; charset=utf-8";
                    synthetic {"
                <!DOCTYPE html>
                <html lang="en">
                <head>
                  <meta charset="UTF-8">
                  <meta name="viewport" content="width=device-width, initial-scale=1.0">
                  <title>Page Not Found - Mealfinding</title>
                  <style>
                    body { font-family: system-ui, sans-serif; max-width: 600px; margin: 100px auto; padding: 20px; text-align: center; }
                    h1 { color: #333; }
                    p { color: #666; }
                    a { color: #0066cc; }
                  </style>
                </head>
                <body>
                  <h1>Page Not Found</h1>
                  <p>The page you're looking for doesn't exist. <a href="/">Go to homepage</a></p>
                </body>
                </html>
                "};
                    return(deliver);
                  }
                }
            EOT -> null
          - main    = true -> null
          - name    = "main" -> null
        }
      + vcl {
          + content = <<-EOT
                # Custom VCL for Mealfinding CDN
                # Handles subdomain-based routing, cache key customization, and error handling
                
                # ============================================
                # BACKEND DECLARATIONS (auto-generated by Terraform)
                # Reference names: F_web_origin, F_api_origin
                # ============================================
                
                sub vcl_recv {
                  #FASTLY recv
                
                  # ----------------------------------------
                  # Backend Selection Based on Subdomain
                  # ----------------------------------------
                
                  # Route API subdomain to API backend
                  if (req.http.host == "api.mealfinding.com") {
                    set req.backend = F_api_origin;
                  }
                  # Route www and apex domain to web backend
                  else if (req.http.host ~ "^(www\.)?mealfinding\.com$") {
                    set req.backend = F_web_origin;
                  }
                  # Default fallback to web backend
                  else {
                    set req.backend = F_web_origin;
                  }
                
                  # ----------------------------------------
                  # Force HTTPS
                  # ----------------------------------------
                  if (!req.http.Fastly-SSL) {
                    error 801 "Force HTTPS";
                  }
                
                  # ----------------------------------------
                  # Redirect apex to www (optional - commented out by default)
                  # ----------------------------------------
                  # if (req.http.host == "mealfinding.com") {
                  #   error 802 "Redirect to www";
                  # }
                
                  # ----------------------------------------
                  # Normalize Accept-Encoding for better cache hit ratio
                  # ----------------------------------------
                  if (req.http.Accept-Encoding) {
                    if (req.http.Accept-Encoding ~ "br") {
                      set req.http.Accept-Encoding = "br";
                    } elsif (req.http.Accept-Encoding ~ "gzip") {
                      set req.http.Accept-Encoding = "gzip";
                    } else {
                      unset req.http.Accept-Encoding;
                    }
                  }
                
                  # ----------------------------------------
                  # Strip query params from static assets for better cache hit ratio
                  # ----------------------------------------
                  if (req.url.ext ~ "^(js|css|png|jpg|jpeg|gif|ico|svg|woff|woff2|ttf|eot|webp|avif)$") {
                    set req.url = req.url.path;
                  }
                
                  # ----------------------------------------
                  # API: Don't cache requests with Authorization header
                  # ----------------------------------------
                  if (req.http.host == "api.mealfinding.com" && req.http.Authorization) {
                    return(pass);
                  }
                }
                
                sub vcl_hash {
                  #FASTLY hash
                
                  # Include host in cache key to separate www vs api content
                  if (req.http.host) {
                    hash_data(req.http.host);
                  }
                }
                
                sub vcl_fetch {
                  #FASTLY fetch
                
                  # ----------------------------------------
                  # Static Assets: Set long TTL
                  # ----------------------------------------
                  if (req.url.ext ~ "^(js|css|png|jpg|jpeg|gif|ico|svg|woff|woff2|ttf|eot|webp|avif)$") {
                    # Cache static assets for 1 day at edge, allow stale for 7 days
                    set beresp.ttl = 86400s;
                    set beresp.stale_while_revalidate = 604800s;
                    set beresp.stale_if_error = 604800s;
                  }
                
                  # ----------------------------------------
                  # HTML: Set moderate TTL for SSG content
                  # ----------------------------------------
                  if (beresp.http.Content-Type ~ "text/html") {
                    set beresp.ttl = 3600s;
                    set beresp.stale_while_revalidate = 3600s;
                    set beresp.stale_if_error = 86400s;
                  }
                
                  # ----------------------------------------
                  # API: Respect Cache-Control headers, or don't cache
                  # ----------------------------------------
                  if (req.http.host == "api.mealfinding.com") {
                    # If origin doesn't set cache headers, don't cache
                    if (!beresp.http.Cache-Control) {
                      set beresp.ttl = 0s;
                      return(pass);
                    }
                  }
                
                  # ----------------------------------------
                  # Don't cache error responses
                  # ----------------------------------------
                  if (beresp.status >= 500 && beresp.status < 600) {
                    set beresp.ttl = 0s;
                    return(pass);
                  }
                }
                
                sub vcl_deliver {
                  #FASTLY deliver
                
                  # ----------------------------------------
                  # Add cache status header for debugging
                  # ----------------------------------------
                  if (resp.http.X-Cache) {
                    set resp.http.X-Cache = resp.http.X-Cache ", " if(fastly_info.state ~ "^HIT", "HIT", "MISS");
                  } else {
                    set resp.http.X-Cache = if(fastly_info.state ~ "^HIT", "HIT", "MISS");
                  }
                
                  # Add cache hits info
                  set resp.http.X-Cache-Hits = obj.hits;
                }
                
                sub vcl_error {
                  #FASTLY error
                
                  # ----------------------------------------
                  # Custom Error: Force HTTPS redirect
                  # ----------------------------------------
                  if (obj.status == 801) {
                    set obj.status = 301;
                    set obj.http.Location = "https://" + req.http.host + req.url;
                    set obj.response = "Moved Permanently";
                    synthetic {""};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom Error: Redirect apex to www
                  # ----------------------------------------
                  if (obj.status == 802) {
                    set obj.status = 301;
                    set obj.http.Location = "https://www.mealfinding.com" + req.url;
                    set obj.response = "Moved Permanently";
                    synthetic {""};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom 503 Error Page
                  # ----------------------------------------
                  if (obj.status == 503) {
                    set obj.http.Content-Type = "text/html; charset=utf-8";
                    synthetic {"
                <!DOCTYPE html>
                <html lang="en">
                <head>
                  <meta charset="UTF-8">
                  <meta name="viewport" content="width=device-width, initial-scale=1.0">
                  <title>Temporarily Unavailable - Mealfinding</title>
                  <style>
                    body { font-family: system-ui, sans-serif; max-width: 600px; margin: 100px auto; padding: 20px; text-align: center; }
                    h1 { color: #333; }
                    p { color: #666; }
                  </style>
                </head>
                <body>
                  <h1>We'll be right back</h1>
                  <p>Mealfinding is temporarily unavailable. Please try again in a few moments.</p>
                </body>
                </html>
                "};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom 404 Error Page
                  # ----------------------------------------
                  if (obj.status == 404) {
                    set obj.http.Content-Type = "text/html; charset=utf-8";
                    synthetic {"
                <!DOCTYPE html>
                <html lang="en">
                <head>
                  <meta charset="UTF-8">
                  <meta name="viewport" content="width=device-width, initial-scale=1.0">
                  <title>Page Not Found - Mealfinding</title>
                  <style>
                    body { font-family: system-ui, sans-serif; max-width: 600px; margin: 100px auto; padding: 20px; text-align: center; }
                    h1 { color: #333; }
                    p { color: #666; }
                    a { color: #0066cc; }
                  </style>
                </head>
                <body>
                  <h1>Page Not Found</h1>
                  <p>The page you're looking for doesn't exist. <a href="/">Go to homepage</a></p>
                </body>
                </html>
                "};
                    return(deliver);
                  }
                }
            EOT
          + main    = true
          + name    = "main"
        }

        # (6 unchanged blocks hidden)
    }

  # fastly_tls_subscription.mealfinding will be created
  + resource "fastly_tls_subscription" "mealfinding" {
      + certificate_authority   = "lets-encrypt"
      + certificate_id          = (known after apply)
      + common_name             = "mealfinding.com"
      + configuration_id        = (known after apply)
      + created_at              = (known after apply)
      + domains                 = [
          + "api.mealfinding.com",
          + "mealfinding.com",
          + "www.mealfinding.com",
        ]
      + force_destroy           = false
      + force_update            = false
      + id                      = (known after apply)
      + managed_dns_challenge   = (known after apply)
      + managed_dns_challenges  = (known after apply)
      + managed_http_challenges = (known after apply)
      + state                   = (known after apply)
      + updated_at              = (known after apply)
    }

  # fastly_tls_subscription_validation.mealfinding will be created
  + resource "fastly_tls_subscription_validation" "mealfinding" {
      + id              = (known after apply)
      + subscription_id = (known after apply)
    }

Plan: 6 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + active_version      = (known after apply)
  + service_id          = (known after apply)
  + tls_dns_challenges  = (known after apply)
  + tls_state           = (known after apply)
  + tls_subscription_id = (known after apply)

```

</details>

**Workflow Run:** https://github.com/sword42/mealfinding-cdn/actions/runs/20710313279
